# 公众号配置
# 公众号appId
app_id = "wx1d0719fffdb057ee"
# 公众号appSecret
app_secret = "807b5f5b643e7ada86ec67b80094592f"
# 模板消息id
# 每日消息
template_id1 = "upJZC1lm2bUNsCnTtJOJ0rNT_Bi5HoY_qUl104x54jc"
# 课程消息,上课提醒
template_id2 = "BGya0JFIjkN7nGqGjIOTEcvlXaB_tWxE84zMxIe8LBk"
# 晚安心语
template_id3 = "mQne8WShcmcPajC-rAaG8MUzv9azAJiGbaqXrQPZmyo"
# 接收公众号消息的微信号
# 这是openid
user = ["o2hao6uimagROtJZpd5siNWe5ijY"]

# 信息配置
# 所在省份
province = "河北"
# 所在城市
city = "承德"
# 生日，如果月份或者日期小于10，直接用对应的数字即可，例如1997-1-1，---------倒计时
birthday = "2004-4-7"
# 在一起的日子，格式同上------------计时器
love_date = "2022-10-27"
# 天行数据晚安心语 key
good_Night_Key = "122971c436425b8d1995eace20e45521"
# -------------------------------------------------------------------------
# 设置学期第一周开始日期
year = 2025
month = 3
day = 3
# 每日推送时间
post_Time = "07:35:00"
# 每节课提醒时间（有课才会提醒）, 时:分:秒  的形式, 字符串, 根据个人需要设置几次
time_table = ["07:40:00", "09:40:00", "13:40:00", "15:40:00"]
# 课程时间
course_Time = ["8:00--9:45", "10:00--11:45", "14:00--15:45", "16:00--17:45"]
# 晚安心语及第二天课程推送时间
good_Night_Time = "22:55:00"
# 课程表 "1"代表第一周，依次类推，根据个人实际课表添加，有几周就添加几周,
# 每一行代表一天, 例如  ['', '编译原理', '', '数据库原理及应用', '数据分析原理', '']  代表周一
classes = \
    {
      "1": [
        ['', '智能终端开发', '智能终端开发', ''],
        ['', 'SpringBoot', '', ''],
        ['爬虫', '', '', '排球'],
        ['计算机组成原理', '智能终端开发', '', ''],
        ['SpringBoot', '', '计算机组成原理', ''],
        ['', '', '', ''],
        ['', '', '', '']
      ],
      "2": [
        ['', '智能终端开发', '智能终端开发', ''],
        ['', 'SpringBoot', '', ''],
        ['爬虫', '', '', '排球'],
        ['计算机组成原理', '智能终端开发', '', ''],
        ['SpringBoot', '', '计算机组成原理', ''],
        ['', '', '', ''],
        ['', '', '', '']
      ],
      "3": [
        ['', '智能终端开发', '智能终端开发', ''],
        ['', 'SpringBoot', '', ''],
        ['爬虫', '', '', '排球'],
        ['计算机组成原理', '智能终端开发', '', ''],
        ['SpringBoot', '', '计算机组成原理', ''],
        ['', '', '', ''],
        ['', '', '', '']
      ],
      "4": [
        ['', '智能终端开发', '智能终端开发', ''],
        ['', 'SpringBoot', '', ''],
        ['爬虫', '', '', '排球'],
        ['计算机组成原理', '智能终端开发', '', ''],
        ['SpringBoot', '', '计算机组成原理', ''],
        ['', '', '', ''],
        ['', '', '', '']
      ],
      "5": [
        ['', '智能终端开发', '智能终端开发', ''],
        ['', 'SpringBoot', '', ''],
        ['爬虫', '', '', '排球'],
        ['计算机组成原理', '智能终端开发', '', ''],
        ['SpringBoot', '', '计算机组成原理', ''],
        ['', '', '', ''],
        ['', '', '', '']
      ],
      "6": [
        ['', '智能终端开发', '智能终端开发', ''],
        ['', 'SpringBoot', '', ''],
        ['爬虫', '', '', '排球'],
        ['计算机组成原理', '智能终端开发', '', ''],
        ['SpringBoot', '', '计算机组成原理', ''],
        ['', '', '', ''],
        ['', '', '', '']
      ],
      "7": [
        ['', '智能终端开发', '智能终端开发', ''],
        ['', 'SpringBoot', '', ''],
        ['爬虫', '', '', '排球'],
        ['计算机组成原理', '智能终端开发', '', ''],
        ['SpringBoot', '', '计算机组成原理', ''],
        ['', '', '', ''],
        ['', '', '', '']
      ],
      "8": [
        ['', '智能终端开发', '智能终端开发', ''],
        ['', 'SpringBoot', '', ''],
        ['爬虫', '', '', '排球'],
        ['计算机组成原理', '智能终端开发', '', ''],
        ['SpringBoot', '', '计算机组成原理', ''],
        ['', '', '', ''],
        ['', '', '', '']
      ],
      "9": [
        ['', '智能终端开发', '智能终端开发', ''],
        ['', 'SpringBoot', '', ''],
        ['爬虫', '', '', '排球'],
        ['计算机组成原理', '智能终端开发', '', ''],
        ['SpringBoot', '', '计算机组成原理', ''],
        ['', '', '', ''],
        ['', '', '', '']
      ],
      "10": [
        ['', '智能终端开发', '智能终端开发', ''],
        ['', 'SpringBoot', '', ''],
        ['爬虫', '', '', '排球'],
        ['计算机组成原理', '智能终端开发', '', ''],
        ['SpringBoot', '', '计算机组成原理', ''],
        ['', '', '', ''],
        ['', '', '', '']
      ],
      "11": [
        ['', '智能终端开发', '智能终端开发', ''],
        ['', 'SpringBoot', '', ''],
        ['爬虫', '', '', '排球'],
        ['计算机组成原理', '智能终端开发', '', ''],
        ['SpringBoot', '', '计算机组成原理', ''],
        ['', '', '', ''],
        ['', '', '', '']
      ],
      "12": [
        ['', '智能终端开发', '智能终端开发', ''],
        ['', 'SpringBoot', '', ''],
        ['爬虫', '', '', '排球'],
        ['计算机组成原理', '智能终端开发', '', ''],
        ['SpringBoot', '', '计算机组成原理', ''],
        ['', '', '', ''],
        ['', '', '', '']
      ],
      "13": [
        ['', '智能终端开发', '智能终端开发', ''],
        ['', 'SpringBoot', '', ''],
        ['爬虫', '', '', '排球'],
        ['计算机组成原理', '智能终端开发', '', ''],
        ['SpringBoot', '', '计算机组成原理', ''],
        ['', '', '', ''],
        ['', '', '', '']
      ],
      "14": [
        ['', '智能终端开发', '智能终端开发', ''],
        ['', 'SpringBoot', '', ''],
        ['爬虫', '', '', '排球'],
        ['计算机组成原理', '智能终端开发', '', ''],
        ['SpringBoot', '', '计算机组成原理', ''],
        ['', '', '', ''],
        ['', '', '', '']
      ],
      "15": [
        ['', '智能终端开发', '智能终端开发', ''],
        ['', 'SpringBoot', '', ''],
        ['爬虫', '', '', '排球'],
        ['计算机组成原理', '智能终端开发', '', ''],
        ['SpringBoot', '', '计算机组成原理', ''],
        ['', '', '', ''],
        ['', '', '', '']
      ],
      "16": [
        ['', '智能终端开发', '智能终端开发', ''],
        ['', 'SpringBoot', '', ''],
        ['爬虫', '', '', '排球'],
        ['计算机组成原理', '智能终端开发', '', ''],
        ['SpringBoot', '', '计算机组成原理', ''],
        ['', '', '', ''],
        ['', '', '', '']
      ],
      "17": [
        ['', '智能终端开发', '智能终端开发', ''],
        ['', 'SpringBoot', '', ''],
        ['爬虫', '', '', '排球'],
        ['计算机组成原理', '智能终端开发', '', ''],
        ['SpringBoot', '', '计算机组成原理', ''],
        ['', '', '', ''],
        ['', '', '', '']
      ],
      "18": [
        ['', '智能终端开发', '智能终端开发', ''],
        ['', 'SpringBoot', '', ''],
        ['爬虫', '', '', '排球'],
        ['计算机组成原理', '智能终端开发', '', ''],
        ['SpringBoot', '', '计算机组成原理', ''],
        ['', '', '', ''],
        ['', '', '', '']
      ]
        
        # "2": [
        #     ['', '', '编译原理', '', '数据分析原理', ''],
        #     ['数据挖掘技术', '', '乒羽俱乐部3', '', '数据可视化', ''],
        #     ['计算机网络', '', '编译原理', '数据库原理及应用', '', ''],
        #     ['', '', '', '', '数据挖掘技术', '数据挖掘技术'],
        #     ['', '计算机网络', '', '数据挖掘技术6', '', ''],
        #     ['', '', '', '', '数据库原理及应用', ''],
        #     ['', '', '', '', '', '']
        # ],
    }

# 模板 1：每日提醒模板
# 本周是开学的第: {{weeks.DATA}} 周
# 今天是: {{date.DATA}}
# 城市： {{city.DATA}}
# 天气： {{weather.DATA}}
# 最低气温: {{min_temperature.DATA}}
# 最高气温: {{max_temperature.DATA}}
# 今天是在一起的第: {{love_day.DATA}} 天
# 距离破壳日还有: {{birthday.DATA}} 天
# ----------------今日课程----------------
# 第一讲: {{firstClass.DATA}}
# 第二讲: {{secondClass.DATA}}
# 第三讲: {{thirdClass.DATA}}
# 第四讲: {{fourthClass.DATA}}


# 模板 2 课程单推
# 课程信息: {{classInfo.DATA}}

# 模板 3 晚安心语推送和第二天课程推送
# {{goodNight.DATA}}
# ----------------明日课程----------------
# 明天是: {{week.DATA}}
# 第一讲: {{firstClass.DATA}}
# 第二讲: {{secondClass.DATA}}
# 第三讲: {{thirdClass.DATA}}
# 第四讲: {{fourthClass.DATA}}